Revit 2027 API
FabricationPart.InsulationLiningElementId Property
 The Revit element id of the fabrication insulation or lining, or invalidElementId if the part has no insulation or lining.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId InsulationLiningElementId { get; }
Public ReadOnly Property InsulationLiningElementId As ElementId
	Get
public:
property ElementId^ InsulationLiningElementId {
	ElementId^ get ();
}
member InsulationLiningElementId : ElementId with get
Property Value
ElementId
See Also
Reference
FabricationPart Class
Autodesk.Revit.DB Namespace